* 11.4 Type constructors and kinds

  #+BEGIN_SRC haskell :eval never
  data [] a = [] | a : [a]
  #+END_SRC

  This must be applied to a concrete type before we have a list.

  Kinds are the types of types, or types one level up. We represent
  kinds in Haskell with ~*~. We know something is a fully applied,
  concrete type when it is represented as ~*~. When it is ~* -> *~,
  it, like a function, is still waiting to be applied.

  #+BEGIN_SRC haskell :results output :wrap EXAMPLE :epilogue ":load"
  :k Bool
  :k [Int]
  :k []
  #+END_SRC

  #+RESULTS:
  #+BEGIN_EXAMPLE
  Bool :: *
  [Int] :: *
  [] :: * -> *
  #+END_EXAMPLE

  ~Bool~ and ~[Int]~ are fully applied and therefore are /concrete
  types/. ~[]~ still needs to be applied to become a concrete type,
  this is what /constructor/ in "type constructor" stands for.

** Record Syntax

   The following solution to represent a person
   #+BEGIN_SRC haskell :results output :wrap EXAMPLE :post ghci-clean(content=*this*) :epilogue ":load"
   data Person = Person String Int deriving (Eq, Show)

   jm = Person "Julie" 27
   rk = Person "Rick" 42

   :{
   name :: Person -> String
   name (Person n _) = n
   :}

   :t name
   name jm
   #+END_SRC

   #+RESULTS:
   #+BEGIN_EXAMPLE
   name :: Person -> String
   Julie
   #+END_EXAMPLE

   Can be replaced with a record syntax, a function for each field
   (in this case ~name~ and ~age~) will be implicitly defined
   #+BEGIN_SRC haskell :results output :wrap EXAMPLE :post ghci-clean(content=*this*) :epilogue ":load"
   data Person = Person {name :: String, age :: Int} deriving (Eq, Show)

   jm = Person "Julie" 27
   rk = Person "Rick" 42

   :t name
   :t age

   name jm
   #+END_SRC

   #+RESULTS:
   #+BEGIN_EXAMPLE
   name :: Person -> String
   age :: Person -> Int
   Julie
   #+END_EXAMPLE

* 11.13 Constructing and Deconstructiong Values

   See how ~Sum~ and ~Product~ can generalise sum and product types
   #+BEGIN_SRC haskell :results none
   data Sum a b = First a | Second b deriving (Eq, Show)
   data Product a b = Product a b deriving (Eq, Show)
   #+END_SRC

   How to use them
   #+BEGIN_SRC haskell :results none
   data Twitter = Twitter deriving (Eq, Show)
   data Reddit = Reddit deriving (Eq, Show)
   type SocialNetwork = Sum Twitter Reddit
   #+END_SRC

   How to construct values
   #+BEGIN_SRC haskell :results output :wrap EXAMPLE :post ghci-clean(content=*this*) :epilogue ":load"
   First Twitter :: SocialNetwork
   Second Reddit :: SocialNetwork

   -- the following are not valid
   First Reddit :: SocialNetwork
   Second Twitter :: SocialNetwork
   #+END_SRC

   #+RESULTS:
   #+BEGIN_EXAMPLE
   First Twitter
   Second Reddit
   <interactive>:328:1: error:
       • Couldn't match type ‘Reddit’ with ‘Twitter’
         Expected type: SocialNetwork
           Actual type: Sum Reddit Reddit
       • In the expression: First Reddit :: SocialNetwork
         In an equation for ‘it’: it = First Reddit :: SocialNetwork
   <interactive>:329:1: error:
       • Couldn't match type ‘Twitter’ with ‘Reddit’
         Expected type: SocialNetwork
           Actual type: Sum Twitter Twitter
       • In the expression: Second Twitter :: SocialNetwork
         In an equation for ‘it’: it = Second Twitter :: SocialNetwork
   #+END_EXAMPLE

   Type aliases will let to create what you will consider the wrong
   types
   #+BEGIN_SRC haskell :results none
   data Sum a b = First a | Second b deriving (Eq, Show)
   type Twitter = String
   type Reddit = String
   type SocialNetwork = Sum Twitter Reddit

   First "Twitter" :: SocialNetwork
   Second "Reddit" :: SocialNetwork

   First "Reddit" :: SocialNetwork
   Second "Twitter" :: SocialNetwork
   #+END_SRC

   Accidental bottoms in records
   #+BEGIN_SRC haskell :results output :wrap EXAMPLE :post ghci-clean(content=*this*) :epilogue ":load"
   data Car = Null | Car {model :: String , year :: Integer}

   :t model
   :t Null

   -- So the type system will let us do this
   model Null
   #+END_SRC

   #+RESULTS:
   #+BEGIN_EXAMPLE
   model :: Car -> String
   Null :: Car
   "*** Exception: No match in record selector model
   #+END_EXAMPLE

   Avoid accidental bottoms in records
   #+BEGIN_SRC haskell :results output :wrap EXAMPLE :post ghci-clean(content=*this*) :epilogue ":load"
   data Car = Car {model :: String, year :: Integer} deriving (Eq, Show)
   data Automobile = Null | Automobile Car

   boxter = Car {model = "Porche Boxter", year = 2016}
   :t model
   model boxter
   model Null
   #+END_SRC

   #+RESULTS:
   #+BEGIN_EXAMPLE
   model :: Car -> String
   Porche Boxter
   <interactive>:771:7: error:
       • Couldn't match expected type ‘Car’ with actual type ‘Automobile’
       • In the first argument of ‘model’, namely ‘Null’
         In the expression: model Null
         In an equation for ‘it’: it = model Null
   #+END_EXAMPLE

** Exercises: Programmers
   Given the types
   #+BEGIN_SRC haskell :results none
   :{
   data OperatingSystem = GnuPlusLinux
                        | OpenBSD
                        | Mac
                        | Windows
                        deriving (Eq, Show)
   :}

   :{
   data ProgrammingLanguage = Haskell
                            | Agda
                            | Idris
                            | PureScript
                            deriving (Eq, Show)
   :}

   :{
   data Programmer = Programmer { lang :: ProgrammingLanguage
                                , os :: OperatingSystem
                                }
                     deriving (Eq, Show)
   :}
   #+END_SRC

   Write a function that generates all possible values of
   ~Programmer~. Use the provided lists of inhabitants of
   ~OperatingSystem~ and ~ProgrammingLanguages~.
   #+BEGIN_SRC haskell :results output :wrap EXAMPLE :post ghci-clean(content=*this*) :epilogue ":load"
   :{
   allOperatingSystems :: [OperatingSystem]
   allOperatingSystems = [ GnuPlusLinux
                         , OpenBSD
                         , Mac
                         , Windows
                         ]
   :}

   :{
   allProgrammingLanguages :: [ProgrammingLanguage]
   allProgrammingLanguages = [ Haskell
                             , Agda
                             , Idris
                             , PureScript
                             ]
   :}

   :{
   allProgrammers :: [Programmer]
   allProgrammers = [ Programmer { os = os, lang = lang } | os <- allOperatingSystems, lang <- allProgrammingLanguages ]
   :}

   allProgrammers
   #+END_SRC

   #+RESULTS:
   #+BEGIN_EXAMPLE
   [Programmer {lang = Haskell, os = GnuPlusLinux},
    Programmer {lang = Agda, os = GnuPlusLinux},
    Programmer {lang = Idris, os = GnuPlusLinux},
    Programmer {lang = PureScript, os = GnuPlusLinux},
    Programmer {lang = Haskell, os = OpenBSD},
    Programmer {lang = Agda, os = OpenBSD},
    Programmer {lang = Idris, os = OpenBSD},
    Programmer {lang = PureScript, os = OpenBSD},
    Programmer {lang = Haskell, os = Mac},
    Programmer {lang = Agda, os = Mac},
    Programmer {lang = Idris, os = Mac},
    Programmer {lang = PureScript, os = Mac},
    Programmer {lang = Haskell, os = Windows},
    Programmer {lang = Agda, os = Windows},
    Programmer {lang = Idris, os = Windows},
    Programmer {lang = PureScript, os = Windows}]
   #+END_EXAMPLE

* 11.15 Higher-Kinded Types
  - Kinds are the types of type constructors, primarily encoding the
    number of arguments they take
  - The default kind in Haskell is ~*~
  - Kinds are not types until they are fully applied
  - Only types have inhabitants at the term level
  - Higher-Kinded types are the kinds that need to be applied more
    than once to become types

  #+BEGIN_SRC haskell :results output :wrap EXAMPLE :post ghci-clean(content=*this*) :epilogue ":load"
  data Silly a b c d = Silly a b c d deriving Show

  :kind Silly

  :kind (,,,)
  :kind (,,,) Int
  :kind (,,,) Int Int
  :kind (,,,) Int Int Int
  :kind (,,,) Int Int Int Int
  #+END_SRC

  #+RESULTS:
  #+BEGIN_EXAMPLE
  Silly :: * -> * -> * -> * -> *
  (,,,) :: * -> * -> * -> * -> *
  (,,,) Int :: * -> * -> * -> *
  (,,,) Int Int :: * -> * -> *
  (,,,) Int Int Int :: * -> *
  (,,,) Int Int Int Int :: *
  #+END_EXAMPLE

* 11.16 Lists are Polymorphic
  Lists are polymorphic because they can contain values of any types

  #+BEGIN_EXAMPLE
  data [] a = [] | a : [a]
  #+END_EXAMPLE

  The type constructor ~[]~ has an argument ~a~ which is not known
  until the type constructor is fully applied.

  #+BEGIN_SRC haskell :results output :wrap EXAMPLE :post ghci-clean(content=*this*) :epilogue ":load"
  :kind []
  :kind [] Int
  :kind [Int]
  :t []
  :t [] :: [Int]
  :t [5 :: Int]
  #+END_SRC

  #+RESULTS:
  #+BEGIN_EXAMPLE
  [] :: * -> *
  [] Int :: *
  [Int] :: *
  [] :: [a]
  [] :: [Int] :: [Int]
  [5 :: Int] :: [Int]
  #+END_EXAMPLE

** Exercise: Insert into ~BinaryTree~

   #+BEGIN_SRC haskell :results output :wrap EXAMPLE :post ghci-clean(content=*this*) :epilogue "0"
   :{
   insert :: Ord a => a -> BinaryTree a -> BinaryTree a
   insert x Leaf = Node Leaf x Leaf
   insert x (Node left v right)
       | x < v = Node (insert x left) v right
       | x > v = Node left v (insert x right)
       | x == v = Node left v right
   :}

   insert 5 Leaf
   insert 5 $ insert 4 $ Leaf
   insert 5 $ insert 4 $ insert 6 $ Leaf
   #+END_SRC

   #+RESULTS:
   #+BEGIN_EXAMPLE
   Node Leaf 5 Leaf
   Node Leaf 4 (Node Leaf 5 Leaf)
   Node (Node Leaf 4 (Node Leaf 5 Leaf)) 6 Leaf
   #+END_EXAMPLE

** Exercise: Write a map function for ~BinaryTree~

   #+BEGIN_SRC haskell :results output :wrap EXAMPLE :post ghci-clean(content=*this*) :epilogue "0"
   :{
   mapTree :: (a -> b) -> BinaryTree a -> BinaryTree b
   mapTree _ Leaf = Leaf
   mapTree a2b (Node left a right) = Node (mapTree a2b left) (a2b a) (mapTree a2b right)
   :}

   t = insert 5 $ insert 4 $ insert 6 $ Leaf
   t
   mapTree (*2) t
   #+END_SRC

   #+RESULTS:
   #+BEGIN_EXAMPLE
   Node (Node Leaf 4 (Node Leaf 5 Leaf)) 6 Leaf
   Node (Node Leaf 8 (Node Leaf 10 Leaf)) 12 Leaf
   #+END_EXAMPLE

** Exercise: Convert ~BinaryTree~ to a List

   #+BEGIN_SRC haskell :results output :wrap EXAMPLE :post ghci-clean(content=*this*) :epilogue "0"
   :{
   preorder :: BinaryTree a -> [a]
   preorder Leaf = []
   preorder (Node left v right) = [v] ++ (preorder left) ++ (preorder right)
   :}

   :{
   inorder :: BinaryTree a -> [a]
   inorder Leaf = []
   inorder (Node left v right) = (inorder left) ++ [v] ++ (inorder right)
   :}

   :{
   postorder :: BinaryTree a -> [a]
   postorder Leaf = []
   postorder (Node left v right) = (postorder left) ++ (postorder right) ++ [v]
   :}

   t = insert 5 $ insert 4 $ insert 6 $ Leaf
   t
   preorder t
   inorder t
   postorder t
   #+END_SRC

   #+RESULTS:
   #+BEGIN_EXAMPLE
   Node (Node Leaf 4 (Node Leaf 5 Leaf)) 6 Leaf
   [6,4,5]
   [4,5,6]
   [5,4,6]
   #+END_EXAMPLE

** Exercise: Write a fold function for ~BinaryTree~

   #+BEGIN_SRC haskell :results output :wrap EXAMPLE :post ghci-clean(content=*this*) :epilogue "0"
   :{
   foldTree :: (a -> b -> b) -> b -> BinaryTree a -> b
   foldTree _ b Leaf = b
   foldTree f b (Node left a right) = foldTree f (f a (foldTree f b left)) right
   :}

   t = insert 5 $ insert 4 $ insert 6 $ Leaf
   t
   foldTree (:) [] t
   #+END_SRC

   #+RESULTS:
   #+BEGIN_EXAMPLE
   Node (Node Leaf 4 (Node Leaf 5 Leaf)) 6 Leaf
   [6,5,4]
   #+END_EXAMPLE

** Ciphers
   Write a [[Vigenère cipher][Vigenère cipher]]. [[file:./chapter-011/Cipher.hs][Solution]]

   #+BEGIN_SRC haskell :results output :noweb yes :wrap EXAMPLE :epilogue ":load" :post ghci-clean(content=*this*)
   <<add-current-chapter-directory-in-path()>>
   :load Cipher

   vigenereEncode ['A'..'Z'] "ALLY" "MEET AT DAWN"
   vigenereEncode ['A'..'Z'] "ALLY" "MEET AT 1234"
   #+END_SRC

   #+RESULTS:
   #+BEGIN_EXAMPLE
   MPPR AE OYWY
   MPPR AE 1234
   #+END_EXAMPLE

** As-Pattern
   Is a way to pattern match on a data constructor but at the same
   time be able to refer to the entire original value

   1. Implement the following funciton with the as-pattern
      #+BEGIN_SRC haskell :eval never
      isSubsequenceOf :: (Eq a) => [a] -> [a] -> Bool
      isSubsequenceOf = undefined
      #+END_SRC

      #+BEGIN_SRC haskell :results output :wrap EXAMPLE :epilogue ":load" :post ghci-clean(content=*this*)
      :{
      isSubsequenceOf :: (Eq a) => [a] -> [a] -> Bool
      isSubsequenceOf [] _ = True
      isSubsequenceOf _ [] = False
      isSubsequenceOf ll@(hl:tl) (hr:tr)
       | hl == hr = isSubsequenceOf tl tr
       | otherwise = isSubsequenceOf ll tr
      :}

      isSubsequenceOf "blah" "blahwoot" == True
      isSubsequenceOf "blah" "wootblah" == True
      isSubsequenceOf "blah" "wboloath" == True
      isSubsequenceOf "blah" "wootbla" == False
      isSubsequenceOf "blah" "halbwoot" == False
      isSubsequenceOf "blah" "blawhoot" == True
      #+END_SRC

      #+RESULTS:
      #+BEGIN_EXAMPLE
      True
      True
      True
      True
      True
      True
      #+END_EXAMPLE

   2. Implement the following function with as-pattern. Split a
      sentence into words and tuple them with their capitalized
      version
      #+BEGIN_SRC haskell :eval never
      capitalizeWords :: String -> [(String, String)]
      capitalizeWords = undefinedf
      #+END_SRC

      #+BEGIN_SRC haskell :results output :wrap EXAMPLE :epilogue ":load" :post ghci-clean(content=*this*)
      import Data.Char (toUpper)

      :{
      capitalizeWords :: String -> [(String, String)]
      capitalizeWords s = map (\w@(h:t) -> (w, (toUpper h) : t))  (words s)
      :}

      capitalizeWords "hello world"
      capitalizeWords "greetings haskellers"
      #+END_SRC

      #+RESULTS:
      #+BEGIN_EXAMPLE
      [("hello","Hello"),("world","World")]
      [("greetings","Greetings"),("haskellers","Haskellers")]
      #+END_EXAMPLE

** Language Exercises

   1. Write a function that capitalize a word

      #+NAME: capitalize-word
      #+BEGIN_SRC haskell :eval never
      import Data.Char (toUpper)

      :{
      capitalizeWord :: String -> String
      capitalizeWord "" = ""
      capitalizeWord (' ':t) = ' ' : (capitalizeWord t)
      capitalizeWord (h:t) = (toUpper h) : t
      :}
      #+END_SRC

      #+BEGIN_SRC haskell :results output :noweb yes :wrap EXAMPLE :epilogue ":load" :post ghci-clean(content=*this*)
      <<capitalize-word>>
      capitalizeWord "Chortle"
      capitalizeWord "chortle"
      capitalizeWord " chortle"
      #+END_SRC

      #+RESULTS:
      #+BEGIN_EXAMPLE
      Chortle
      Chortle
       Chortle
      #+END_EXAMPLE

   2. Write a function that capitalize sentences (reuse ~capitalizeWord~)
      #+BEGIN_SRC haskell :results output :noweb yes :wrap EXAMPLE :epilogue ":load" :post ghci-clean(content=*this*)
      <<capitalize-word>>

      data Split = Whole String | Splitted String String deriving (Eq, Show)

      :{
      splitOn :: Char -> String -> Split
      splitOn _ "" = Whole ""
      splitOn d s =
          case (dropWhile (/= d) s) of
            "" -> Whole s
            rest -> Splitted (takeWhile (/= d) s) (dropWhile (== d) rest)
      :}

      :{
      sentences :: Char -> String -> [String]
      sentences d s =
          case splitOn d s of
            Whole l -> [l]
            Splitted l r -> l : (sentences d r)
      :}

      :{
      unsentences :: Char -> [String] -> String
      unsentences _ (s:ss) = foldl ((++) . (++ ['.'])) s ss
      :}

      :{
      capitalizeParagraph :: String -> String
      capitalizeParagraph s = unsentences '.' $ map capitalizeWord $ sentences '.' s
      :}

      capitalizeParagraph "blah. woot ha."
      capitalizeParagraph "blah. woot ha." == "Blah. Woot ha."
      #+END_SRC

      #+RESULTS:
      #+BEGIN_EXAMPLE
      Blah. Woot ha.
      True
      #+END_EXAMPLE

** Phone
   Remember old-fashioned phone inputs for writing text where you had
   to press a button multiple times to get different letters to come
   up? You’re going to write code to translate sequences of button
   presses into strings and vice versa. Solution [[file:./chapter-011/Phone.hs][here]]

   1. Create a data structure for the phone. [[file:./chapter-011/Phone.hs:18][Solution]]

   2. Convert the following conversations into the keypresses required
      to express them.
      #+NAME: conversations
      #+BEGIN_SRC haskell :eval never
      conversations :: [String]
      conversations =
        ["Wanna play 20 questions",
          "Ya",
          "U 1st haha",
          "Lol ok. Have u ever tasted alcohol",
          "Lol ya",
          "Wow ur cool haha. Ur turn",
          "Ok. Do u think I am pretty Lol",
          "Lol ya",
          "Just making sure rofl ur turn"]
      #+END_SRC

      #+BEGIN_SRC haskell :results output :noweb yes :wrap EXAMPLE :epilogue ":load" :post ghci-clean(content=*this*)
      <<add-current-chapter-directory-in-path()>>
      :load Phone

      :{
      <<conversations>>
      :}

      map (toTaps phone) conversations
      #+END_SRC

      #+RESULTS:
      #+BEGIN_EXAMPLE
      [[('*',1),('9',1),('2',1),('6',2),('6',2),('2',1),('0',1),('7',1),('5',3),('2',1),('9',3),('0',1),('2',4),('0',3),('0',1),('7',2),('8',2),('3',2),('7',4),('8',1),('4',3),('6',3),('6',2),('7',4)],
      [('*',1),('9',3),('2',1)],
      [('*',1),('8',2),('0',1),('1',1),('7',4),('8',1),('0',1),('4',2),('2',1),('4',2),('2',1)],
      [('*',1),('5',3),('6',3),('5',3),('0',1),('6',3),('5',2),('#',1),('0',1),('*',1),('4',2),('2',1),('8',3),('3',2),('0',1),('8',2),('0',1),('3',2),('8',3),('3',2),('7',3),('0',1),('8',1),('2',1),('7',4),('8',1),('3',2),('3',1),('0',1),('2',1),('5',3),('2',3),('6',3),('4',2),('6',3),('5',3)],
      [('*',1),('5',3),('6',3),('5',3),('0',1),('9',3),('2',1)],
      [('*',1),('9',1),('6',3),('9',1),('0',1),('8',2),('7',3),('0',1),('2',3),('6',3),('6',3),('5',3),('0',1),('4',2),('2',1),('4',2),('2',1),('#',1),('0',1),('*',1),('8',2),('7',3),('0',1),('8',1),('8',2),('7',3),('6',2)],
      [('*',1),('6',3),('5',2),('#',1),('0',1),('*',1),('3',1),('6',3),('0',1),('8',2),('0',1),('8',1),('4',2),('4',3),('6',2),('5',2),('0',1),('*',1),('4',3),('0',1),('2',1),('6',1),('0',1),('7',1),('7',3),('3',2),('8',1),('8',1),('9',3),('0',1),('*',1),('5',3),('6',3),('5',3)],
      [('*',1),('5',3),('6',3),('5',3),('0',1),('9',3),('2',1)],
      [('*',1),('5',1),('8',2),('7',4),('8',1),('0',1),('6',1),('2',1),('5',2),('4',3),('6',2),('4',1),('0',1),('7',4),('8',2),('7',3),('3',2),('0',1),('7',3),('6',3),('3',3),('5',3),('0',1),('8',2),('7',3),('0',1),('8',1),('8',2),('7',3),('6',2)]]
      #+END_EXAMPLE

   3. How many times do digits need to be pressed for each message?
      #+BEGIN_SRC haskell :results output :noweb yes :wrap EXAMPLE :epilogue ":load" :post ghci-clean(content=*this*)
      <<add-current-chapter-directory-in-path()>>
      :load Phone

      :{
      <<conversations>>
      :}

      map (fingerTaps . toTaps phone) conversations
      #+END_SRC

      #+RESULTS:
      #+BEGIN_EXAMPLE
      [49,5,17,71,15,49,58,15,60]
      #+END_EXAMPLE

   4. What was the most popular letter for each message? What was its
      cost?
      #+BEGIN_SRC haskell :results output :noweb yes :wrap EXAMPLE :epilogue ":load" :post ghci-clean(content=*this*)
      <<add-current-chapter-directory-in-path()>>
      :load Phone

      :{
      <<conversations>>
      :}

      -- What was the most popular letter for each message?
      map mostPopularLetter conversations

      -- What was its cost?
      map (costOfMostPopularLetter phone) conversations
      #+END_SRC

      #+RESULTS:
      #+BEGIN_EXAMPLE
      nah y  y
      [6,1,4,6,3,5,7,3,5]
      #+END_EXAMPLE

   5. What was the most popular letter overall? What was the most
      popular word?
      #+BEGIN_SRC haskell :results output :noweb yes :wrap EXAMPLE :epilogue ":load" :post ghci-clean(content=*this*)
      <<add-current-chapter-directory-in-path()>>
      :load Phone

      :{
      <<conversations>>
      :}

      -- What was the most popular letter overall?
      mostPopularLetter (concat conversations)

      -- What was the most popular word?
      mostPopularWord (concat conversations)
      #+END_SRC

      #+RESULTS:
      #+BEGIN_EXAMPLE
      ' '
      ur
      #+END_EXAMPLE

** Hutton's Razor
   Given the type

   #+NAME: hutton
   #+BEGIN_SRC haskell :eval never
   data Expr
     = Lit Integer
     | Add Expr Expr
   #+END_SRC

   1. Your first task is to write the “eval” function which reduces an
      expression to a final sum.

      #+BEGIN_SRC haskell :results output :noweb yes :wrap EXAMPLE :epilogue ":load" :post ghci-clean(content=*this*)
      :{
      <<hutton>>
      :}

      :{
      eval :: Expr -> Integer
      eval (Lit n) = n
      eval (Add e1 e2) = (eval e1) + (eval e2)
      :}

      eval (Add (Lit 1) (Lit 9001))
      eval (Add (Lit 1) (Lit 9001)) == 9002
      #+END_SRC

      #+RESULTS:
      #+BEGIN_EXAMPLE
      9002
      True
      #+END_EXAMPLE

   2. Write a printer for the expressions.

      #+BEGIN_SRC haskell :results output :noweb yes :wrap EXAMPLE :epilogue ":load" :post ghci-clean(content=*this*)
      :{
      <<hutton>>
      :}

      :{
      printExpr :: Expr -> String
      printExpr (Lit n) = show n
      printExpr (Add e1 e2) = concat [(printExpr e1), " + ", (printExpr e2)]
      :}

      printExpr (Add (Lit 1) (Lit 9001))
      printExpr (Add (Lit 1) (Lit 9001)) == "1 + 9001"

      let a1 = Add (Lit 9001) (Lit 1)
      let a2 = Add a1 (Lit 20001)
      let a3 = Add (Lit 1) a2
      printExpr a3
      printExpr a3 == "1 + 9001 + 1 + 20001"
      #+END_SRC

      #+RESULTS:
      #+BEGIN_EXAMPLE
      1 + 9001
      True
      1 + 9001 + 1 + 20001
      True
      #+END_EXAMPLE
